#include <algorithm>
#include <iostream>
#include <limits>
#include <string>
#include <vector>

/*
* 为什么读取失败后要同时调用`clear()`和`ignore()`？
* `const double&`与`double&`分别向调用者表达什么承诺？
* 为什么不能只靠返回类型区分重载？
* `constexpr`函数是否只能接收编译期常量？
* 默认参数为什么必须从右侧开始连续出现？
*/

/*
    1.不清楚
    1.调用clear是清楚流状态错误信息调用ignore是将缓冲区脏数据清理，如果只调用clear
    会只清理状态，脏数据还在，再读取会立刻出错。只调用ignore脏数据清理掉了但是失败状态
    仍然存在，读取操作会被跳过
    2.const double& 像调用者表达只是减少拷贝的开销，而不能通过该引用修改指向的对象 只读不修改
      double&  既可以减少拷贝的开销，也也可以通过该引用修改指向的对象   可读可修改
    3.因为返回值可以被忽略，参数类型相同会导致调用时编译器无法确定到底调用哪一个函数
    4.不是，constexpr修饰的函数可以在编译期运行，也可以在运行时被调用
        当所有实参都是编译器常量时，再编译期求值
        当任一实参时运行时变量时，退化为普通运行时函数
    5.因为默认参数从左边开始或者不连续出现会导致参数无法匹配，不知道调用时提供的参数具体提供给谁
        本质原因：C++的参数匹配是纯位置匹配，不支持命名参数
*/


int main()
{
    return 0;
}