#include <algorithm>
#include <iostream>
#include <limits>
#include <string>
#include <vector>
/*
        * `std::cin`读取失败后，`clear()`和`ignore()`各解决什么问题？
               std::cin读取失败后，调用clear主要是清理流的读取状态，调用ignore是清理掉流中的错误数据
               只调用clear没有清理错误数据会导致下次读取仍然失败  只调用ignore因为错误状态还在读取会立刻失败
        * `{}`初始化相比未初始化有什么直接价值？
               {}初始化可以避免使用到未初始化的变量导致未定义行为
        * `double& output`和`const double& input`分别表达什么接口方向？
               double& output表示接口方向为读写，可以通过对output进行修改
               const double& input表示接口方向为只读，不能对input进行修改
        * 返回局部变量引用为什么会悬空？
                因为局部变量的声明周期是在函数内，函数结束后变量声明周期结束变量就被释放，所以返回局部变量的引用会导致悬空
        * 为什么只修改返回类型不能形成重载？
                因为函数在调用时可以忽略返回值，就无法形成明确的区分
        * 默认参数为什么必须从右向左连续出现？
                因为不连续或者从左边开始可能和默认参数发生冲突，导致参数匹配失败
        * `inline`是否保证函数调用一定展开？
                inline不能保证函数调用一定展开，是否展开由编译器决定
        * `constexpr`函数接收运行时变量时会发生什么？
                constexpr函数接收运行时变量会让该函数在程序运行时调用
        * 失败时不修改输出参数，应该怎样安排赋值顺序？
                先对输入参数进行判断，通过局部变量接收计算值，当校验通过后再赋值给输出参数
        * 编译通过是否能证明测试逻辑正确？
                编译通过只能说明程序的语法没有问题，不能证明逻辑正确
*/



int main()
{
    return 0;
}
